; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_1 ?v7 - type_3 ?v5 - type_1)
 	      (pred_3 ?v1 - object ?v5 - type_1)
	      (pred_2 ?v7 - type_3 ?v3 - type_2)
	      (pred_4 ?v7 - type_3 ?v1 - object ?v3 - type_2))

   (:action op_2
       :parameters  (?v7 - type_3 ?v8 ?v4 - type_1)
       :precondition (and  (pred_1 ?v7 ?v8))
       :effect (and  (pred_1 ?v7 ?v4)
		     (not (pred_1 ?v7 ?v8))))

   (:action op_3
       :parameters (?v7 - type_3 ?v2 - object ?v6 - type_1 ?v3 - type_2)
       :precondition  (and  (pred_3 ?v2 ?v6) (pred_1 ?v7 ?v6) (pred_2 ?v7 ?v3))
       :effect (and (pred_4 ?v7 ?v2 ?v3)
		    (not (pred_3 ?v2 ?v6)) 
		    (not (pred_2 ?v7 ?v3))))

   (:action op_1
       :parameters (?v7 - type_3 ?v2 - object ?v6 - type_1 ?v3 - type_2)
       :precondition  (and  (pred_4 ?v7 ?v2 ?v3) (pred_1 ?v7 ?v6))
       :effect (and (pred_3 ?v2 ?v6)
		    (pred_2 ?v7 ?v3)
		    (not (pred_4 ?v7 ?v2 ?v3)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_08 obj_04 - type_3
obj_02 obj_10 obj_07 obj_12 - type_2
obj_11 obj_09 obj_06 obj_05 - type_1
obj_01 obj_13 obj_03 - object)
(:init
(pred_1 obj_08 obj_06)
(pred_2 obj_08 obj_02)
(pred_2 obj_08 obj_10)
(pred_1 obj_04 obj_11)
(pred_2 obj_04 obj_07)
(pred_2 obj_04 obj_12)
(pred_3 obj_01 obj_11)
(pred_3 obj_13 obj_06)
(pred_3 obj_03 obj_05)
)
(:goal
(and
(pred_3 obj_01 obj_11)
(pred_3 obj_13 obj_09)
(pred_3 obj_03 obj_09)
)
)

(:constraints
  (always (not (pred_1 obj_08 obj_05)))
)
)

; plan
1. (op_3 obj_08 obj_13 obj_06 obj_10)
   deleted: (pred_3 obj_13 obj_06) (pred_2 obj_08 obj_10)
   added: (pred_4 obj_08 obj_13 obj_10)
   goals met: 1 of 3
2. (op_2 obj_04 obj_11 obj_05)
   deleted: (pred_1 obj_04 obj_11)
   added: (pred_1 obj_04 obj_05)
   goals met: 1 of 3
3. (op_2 obj_08 obj_06 obj_09)
   deleted: (pred_1 obj_08 obj_06)
   added: (pred_1 obj_08 obj_09)
   goals met: 1 of 3
4. (op_3 obj_04 obj_03 obj_05 obj_12)
   deleted: (pred_3 obj_03 obj_05) (pred_2 obj_04 obj_12)
   added: (pred_4 obj_04 obj_03 obj_12)
   goals met: 1 of 3
5. (op_2 obj_04 obj_05 obj_09)
   deleted: (pred_1 obj_04 obj_05)
   added: (pred_1 obj_04 obj_09)
   goals met: 1 of 3
6. (op_1 obj_08 obj_13 obj_09 obj_10)
   deleted: (pred_4 obj_08 obj_13 obj_10)
   added: (pred_3 obj_13 obj_09) (pred_2 obj_08 obj_10)
   goals met: 2 of 3
7. (op_1 obj_04 obj_03 obj_09 obj_12)
   deleted: (pred_4 obj_04 obj_03 obj_12)
   added: (pred_3 obj_03 obj_09) (pred_2 obj_04 obj_12)
   goals met: 3 of 3
